Управление_по_целям_и_KPI/src/Documents/KPI_Планирование/KPI_Планирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_Планирование</name>
  <registerRecords>AccumulationRegister.KPI_Планы</registerRecords>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.KPI_МоделиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСмартЗадач</name>
    <type>
      <types>EnumRef.KPI_ВидыРасчетаСмартЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>ЦелевойПоказатель</name>
      <type>
        <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеФильтраАналитик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючАналитики</name>
      <type>
        <types>CatalogRef.KPI_КлючиАналитики</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стандарты</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.KPI_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыОтветственные</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.KPI_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОценки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесСтандарта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/AccumulationRegisters/KPI_Планы/KPI_Планы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>KPI_Планы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчетаСмартЗадач</name>
    <type>
      <types>EnumRef.KPI_ВидыРасчетаСмартЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеФильтраАналитик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСтандартов</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦелевойПоказатель</name>
    <type>
      <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.KPI_КлючиАналитики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_по_целям_и_KPI/src/Documents/KPI_Планирование/ManagerModule.bsl
//Получает ссылку на документ планирования за указанный период
//Параметры:
// Дата                      - тип дата, дата из периода, за которой надо получить документ
// ПериодичностьПланирования - тип ПеречислениеСсылка.KPI_ПериодичностьПланирования
// СтруктураКомпании         - СправочникСсылка.KPI_СтруктураКомпании
//Возвращаемое значение:
// тип ДокументСсылка.KPI_Планирование
Функция ПолучитьДокПланирование(Дата, ПериодичностьПланирования, СтруктураКомпании) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	KPI_Планирование.Ссылка
	|ИЗ
	|	Документ.KPI_Планирование КАК KPI_Планирование
	|ГДЕ
	|	KPI_Планирование.Дата = &Дата
	|	И KPI_Планирование.СтруктураКомпании = &СтруктураКомпании
	|	И KPI_Планирование.ПериодичностьПланирования = &ПериодичностьПланирования
	|	И KPI_Планирование.Проведен
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	KPI_Планирование.Ссылка
	|ИЗ
	|	Документ.KPI_Планирование КАК KPI_Планирование
	|ГДЕ
	|	KPI_Планирование.Дата = &Дата
	|	И KPI_Планирование.СтруктураКомпании = &СтруктураКомпании
	|	И KPI_Планирование.ПериодичностьПланирования = &ПериодичностьПланирования
	|	И НЕ KPI_Планирование.Проведен
	|	И НЕ KPI_Планирование.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата"                     , KPI_ОбщегоНазначенияСервер.ГраницыПериода(Дата, ПериодичностьПланирования).НачалоПериода);
	Запрос.УстановитьПараметр("ПериодичностьПланирования", ПериодичностьПланирования);
	Запрос.УстановитьПараметр("СтруктураКомпании"        , СтруктураКомпании);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

//Функция получает список планов на период
//Параметры:
// Дата                      - тип дата, дата из периода, за которой надо получить документ
// ПериодичностьПланирования - тип ПеречислениеСсылка.KPI_ПериодичностьПланирования
// СтруктураКомпании         - СправочникСсылка.KPI_СтруктураКомпании
//Возвращаемое значение:
// тип массив, элемент массива СправочникСсылка.KPI_ЦелевыеПоказатели
Функция ПланыОбъектаУправленияНаПериод(Дата, ПериодичностьПланирования, СтруктураКомпании) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	KPI_Планы.ЦелевойПоказатель
	|ИЗ
	|	РегистрНакопления.KPI_Планы КАК KPI_Планы
	|ГДЕ
	|	KPI_Планы.СтруктураКомпании = &СтруктураКомпании
	|	И KPI_Планы.ПериодичностьПланирования = &ПериодичностьПланирования
	|	И KPI_Планы.Период = &Период";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период"                   , KPI_ОбщегоНазначенияСервер.ГраницыПериода(Дата, ПериодичностьПланирования).НачалоПериода);
	Запрос.УстановитьПараметр("ПериодичностьПланирования", ПериодичностьПланирования);
	Запрос.УстановитьПараметр("СтруктураКомпании"        , СтруктураКомпании);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("ЦелевойПоказатель");
	
КонецФункции
